from konlpy.tag import Okt
import pandas as pd
import re

okt = Okt()

# 불용어 목록 정의
EXCLUDE_WORDS = [
 # 정치 및 기관명
    '정부', '공직자', '공무원', '정책', '국가', '제도',
    '위원회', '부처', '국회', '장관', '대통령', '청와대', '서울시',
    '의원', '기자', '위원', '위원장', '관계자', '단체', '기관', '본부',
    '발표', '회의', '예산', '조사', '보고서', '언론', '나라', '시장',

    # 정치인 및 정당
    '윤석열', '윤석렬', '김건희', '이재명', '조국', '문재인', '박근혜',
    '이명박', '국민의힘', '민주당', '더불어민주당', '국힘', '혁신당', '민주',
    '진보', '보수', '더불어',

    # 지명 및 지역
    '한국', '대한민국', '서울', '일본', '대만', '지방', '강진군', '전국', '인천',

    # 불필요 연결어 / 기능어
    '관련', '통해', '의견', '논의', '추진', '방안', '지적',
    '확대', '요구', '대상', '중요', '사실', '입장', '시작', '처리','위해', '대한', '이번',

    # 사건·사고 및 뉴스용어
    '사건', '사안', '피해자', '성폭력', '성희롱', '비서', '비서실',
    '투표', '선거', '대선', '탄핵', '촛불', '법안', '검찰', '심판',

    # 역사/의례/국가보훈
    '전쟁', '호국', '현충일', '독립운동', '독립운동가', '태극기', '유공', '보훈', '희생',

    # 일반 사회어
    '학교', '학생', '아이', '유치원', '부모', '친구', '급식',
    '출산율', '가족', '노인', '주택', '지역', '부담',

    # 기사 작성용 표현
    '대표', '기획', '기분', '결정', '사실', '지난달', '시간', '내년', '사정', '선임', '발생', '신고',

    # 기타 불필요 단어
    '효능', '연구원', '연구소', '사회학', '독자', '평가', '대책', '악성', '피크', '지난해', '인상', '지난', '추념', '주목', '최근', '이상', '사람', '여론조사'
]

def clean_text(text):
    text = re.sub(r"[^가-힣\s]", " ", str(text))
    nouns = okt.nouns(text)
    nouns = [n for n in nouns if len(n) > 1 and n not in stopwords]
    return " ".join(nouns)

for period in ["2015_2019", "2020_2025"]:
    df = pd.read_csv(f"../datas/preprocessed_{period}.csv", encoding="utf-8-sig")
    df["clean_text"] = df["text"].apply(clean_text)
    df.to_csv(f"../datas/clean_{period}.csv", index=False, encoding="utf-8-sig")
    print(f"clean_{period}.csv 생성 완료")
