# -*- coding: utf-8 -*-

def STOPWORDS():
    return [
        # 정치 및 기관명
        '정부', '공직자', '정책', '국가', '제도',
        '위원회', '부처', '국회', '장관', '대통령', '청와대', '서울시',
        '의원', '기자', '위원', '위원장', '관계자', '단체', '기관', '본부',
        '발표', '회의', '예산', '조사', '보고서', '언론', '나라', '시장',

        # 정치인 및 정당
        '윤석열', '윤석렬', '김건희', '이재명', '조국', '문재인', '박근혜', '박원순',
        '이명박', '국민의힘', '민주당', '더불어민주당', '국힘', '혁신당', '민주',
        '진보', '보수', '더불어', '애국',

        # 지명 및 지역
        '한국', '대한민국', '서울', '일본', '대만', '지방', '강진군', '전국', '인천',

        # 불필요 연결어 / 기능어
        '관련', '통해', '의견', '논의', '추진', '방안', '지적',
        '확대', '요구', '대상', '중요', '사실', '입장', '시작', '처리', '위해', '대한', '이번',

        # 사건·사고 및 뉴스용어
        '사건', '사안', '피해자', '성폭력', '성희롱', '비서', '비서실',
        '투표', '선거', '대선', '탄핵', '촛불', '법안', '검찰', '심판',

        # 역사/의례/국가보훈
        '전쟁', '호국', '현충일', '독립운동', '독립운동가', '태극기', '유공', '보훈', '희생',

        # 일반 사회어
        '학교', '학생', '아이', '유치원', '부모', '친구', '급식',
        '출산율', '가족', '노인', '주택', '지역', '부담',

        # 기사 작성용 표현
        '대표', '기획', '기분', '결정', '지난달', '시간', '내년', '사정', '선임', '발생', '신고',

        # 기타 불필요 단어
        '효능', '연구원', '연구소', '사회학', '독자', '평가', '대책', '악성', '피크', '지난해', '인상', '지난', '추념', '주목', '최근', '이상', '사람', '여론조사',

        '뉴스', '오늘', '어제', '내일', '경우', '때문', '정도', '이후', '당시', '가운데', '내용', '진행', '참석', '설명', '확인', '사회', '경제', '국민', '앵커',

        '우리나라', '회사', '성장', '검사', '수사', '혐의', '재판', '감독', '영화',
        '경기', '수출', '투자', '제품', '금융', '산업', '서비스',
        '작품', '배우', '공연', '스포츠', '축구', '야구', '기업', '삼성', '현대',
        '일자리', '취업', '고용', '발전', '미래', '성공', '역할', '기회', '도전', '안전', '반대', '책임',
        '출신', '국정원', '여야', '변화', '사고', '해결', '아파트', '후보자',
        '법무부', '총장', '국민들', '분들', '적용', '방식', '과거', '시대', '대응',
        '정권', '변호사', '추가', '본인', '핵심', '발언', '노력', '상태', '자유', '실제',
        '시민', '구조', '세월', '합의', '과장',

        '사이', '마음', '제기', '조치', '전망', '전문가', '소득', '국정',
        '우리', '가장', '가지', '모든',

        '도시', '주민', '공급', '전략', '환경', '복지',

        '업무', '직원', '개선',

        '것들', '그다음', '차례', '시절', '마지막', '자체', '어디', '무엇',
        '전환', '통과', '선정', '확보', '제시', '이해', '인식', '차이', '여부', '단계',

        '위기', '인정', '예상', '예상시절', '현실', '사태', '표현', '목소리', '모습', '정상',
        '집중', '특별', '필요', '기대', '고민', '반도체', '세계', '글로벌',

        '행사', '사진', '기록', '보고', '자료', '질문', '방법', '사례', '설치', '신청',
        '방문', '일정', '현장', '준비', '배포',

        '영국', '독일', '오바마', '김정은', '국회의원', '야당', '통합', '공약',
        '부산총선', '공수처', '자유한국당', '민주주의', '권력',

        '생활', '유지', '운용', '구성', '증가',
        '평균', '선택',

        '감사', '지사', '지급', '총선', '여당', '정당', '헌법', '수석', '팀장', '교사', '학생들', '아이들', '학부모', '교과서',

        '대화', '가치', '방향', '세상', '경쟁', '효과', '전문', '체제', '개별', '각종', '포함',

        '보장', '협의', '시행', '요청',
        '온라인', '지속', '수행', '대비', '경험', '개월', '부산',
        '지지', '백신', '경기도', '가구', '피해',

        '최순실', '김무성', '안철수',
        '정치인', '아버지', '아들', '의사', '환자',

        '교육부', '행정부', '서울대', '삼성전자', '대구', '광주',
        '병원', '센터', '시설',

        '감소', '부족',
        '차원', '측면',

        '하루', '요즘', '제출',
        '브랜드', '디지털', '프로그램', '에너지', '인구', '국민연금',
        '있는', '재정',

        '멘트', '보도', '방송', '생각', '정치', '사업', '대해',
        '현재', '문제', '합니다', '것으로', '있습니다',

        '상황', '지원', '결과', '얘기', '이날',
        '부분', '이유', '이전', '어떻게', '그것',

        '회장', '가격', '판매', '종목', '주식', '코스피', '거래', '증권',

        '예정', '기준', '활동', '영향', '작업',

        '관심', '주요', '최고', '전체',
        '이름', '자리', '시각', '현지', '직접', '그동안',

        '인터뷰', '교수', '출연',

        '미국', '중국', '북한', '새누리당', '사람들', '교육', '자신',
        '가능', '주장', '대학', '가능성', '이야기', '계획', '말씀', '트럼프',

        '운영', '강조', '수준', '정보', '공개', '관리', '현황', '이용', '활용', '기반', '설계', '검토',

        '경찰', '부동산', '법원',

        '목표', '역사', '비판', '논란', '만큼', '사용', '의미', '판단', '분야', '의혹', '최대',
        '문화재', '관광', '총리', '규모',
        '기간', '한국당', '문화', '선수', '대회', '리포트', '회담', '달러',

        '방역', '플랫폼', '감염', '대법원장', '검찰총장', '도널드', '인공지능', '판사', '통신', '영상',
        '집값', '출시', '데이터', '페이스북', '새정치민주연합', '메르스', '새정치연합',
        '세월호', '참사', '간첩', '김영란법', '최경환', '창조', '이완구', '안전행정부', '박정희',
        '창조경제', '공천', '통일', '투기', '정의당', '장비', '지원금', '전기차', '추경',
        '확산', '홍준표', '지지율', '바이러스', '백악관', '사법', '실시간', '콘텐츠', '정상회담',
        '금품', '반기문', '교육감', '행정자치부', '마을', '공무원들', '위조', '새누리', '기초',
        '김영란', '더민주', '관피아', '아베', '결혼', '이준석', '신규', '청약', '단지', '법관',
        '안행부', '친박', '김기춘', '위안부', '장성택', '그리스', '스마트폰', '부품', '홍콩', '로봇',
        '한미', '업계', '거리', '구축', '부분들', '전교조', '사랑', '행복', '정홍원', '담화',
        '국정화', '기초연금', '경제민주화', '스타트업', '배터리', '이동', '임명', '비리',
        '정치민주연합', '시행령', '증거', '상승', '매출', '고발', '네이버', '대검', '언급', '남북',
        '속도', '게임', '범죄', '개혁안', '한국사', '인터넷', '전보', '특위',
        '테러', '미래부', '중앙일보', '아시아', '남경필', '제재', '소재', '구매', '판정', '아동',
        '공간', '텔레콤', '격리', '주거', '공시', '김종인', '수도권', '밝혔다', '특검',
        '자살', '김한길', '행자부', '버락', '침몰', '협동조합', '미래창조과학부',
        '사무총장', '드라마', '성완종', '추미애', '무역', '생산', '영상편집', '성추행',
        '자영업자', '보유', '정세균', '부회장', '국토부', '보좌관', '빅데이터', '메시지',
        '친박계', '계파', '지도부', '이정현', '신율', '개입', '최영일', '비박',
        '클린턴', '재벌', '기소', '최저', '권고', '감찰', '커뮤니티', '디스플레이',
        '절차', '공유', '제한', '통화', '배달', '차관', '혁신안', '혁신위', '친노',
        '비주류', '이종걸', '야권', '헌재', '세력', '서청원', '채동욱', '수요', '중단',
        '출범', '소비자', '유승민', '우병우', '신문', '노사정', '채용', '금액', '라디오', '징계', '포인트', '외교',
        '인간', '전남', '프레시안',

        '노무현', '김영삼', '노태우', '이승만', '김일성', '김정일',

        '정윤회', '안종범', '조윤선', '정유라', '원세훈', '이석기',
        '정진석', '남재준',

        '정종섭', '안대희', '정의화', '유병언', '황우여', '윤창중', '현오석', '최룡해', '한수진',

        '국가정보원', '총리실', '문화체육관광부', '관광부', '국무조정실', '혁신처',

        '안전처', '국민안전처', '과학부', '감사원', '재판부', '도의회', '삼성그룹', '제일모직',
        '전경련', '한국노총', '노총', '전공노', '공무원노조', '코레일', '중앙대', '동국대', '서강대',

        '유가족', '진도', '선장', '가습기', '살균제', '송전탑', '밀양',

        '개성공단', '핵실험', '사드', '소녀상', '국정교과서', '역사교과서', '특조위',

        '촛불집회', '연말정산', '누리과정', '노동개혁', '민영', '비선', '헬조선', '불통',

        '울산', '경북', '경남', '제주', '러시아', '프랑스', '이라크', '시리아',

        '처형', '독자적', '폐업', '집착', '주권', '비판적', '대륙', '숙제',
        '정계', '하청', '결집', '교과', '제국', '극단적', '종이', '가방', '시계', '대강',
        '한문', '한글', '단위', '퍼센트',

        '한반도', '미사일', '후보', '평화', '선언', '지정', '보호', '완화', '부총리', '올림픽', '위반',

        '시즌', '은행', '작가', '상대', '개최', '조성', '민간', '사과', '발견', '있다', '국제',

        '위험', '협상', '내부', '강화', '사장', '차지',

        '사망', '대북', '차량', '취임', '조선', '중소기업', '원내',

        '북미', '여론', '지시', '제공', '원내대표', '주년', '인기',

        '대변인', '외국인', '기사', '남성', '출마', '사퇴',
        '최종', '연속', '확정', '반응', '결국', '주변', '위한',

        '자동차', '대출', '금리', '유럽', '모델', '분위기',

        '이달', '번째', '동시', '실장', '부장', '의장', '경선', '청문회',

        '구속', '전달', '구체적', '소개', '등급', '분양',

        '비핵화', '하락', '회복', '역대', '공장', '제외', '당국', '협력',

        '과학', '승리', '유엔', '간담회', '지자체', '연결', '진출', '배치', '인물', '마련',

        '홈페이지', '공식', '계기', '취지', '비율', '반영',

        '비교', '일반', '등장', '수도', '치료', '제작', '전화', '상품',

        '소속', '조정', '개정', '개정안', '규정', '심사', '적극', '의지',

        '소식', '올해', '해석', '파악', '원인', '기본', '당선', '정치권',

        '거부', '임기', '추천', '발사', '검증', '자산', '선고', '판결',

        '건물', '역량', '안정', '이익', '전자', '공동', '원장', '이사장', '이사',

        '특정', '상반기', '종합', '고위', '신임', '수상', '프로젝트',

        '예방', '투입', '대전', '뉴욕', '음악', '대기업', '기업들', '보험',

        '걱정', '정신', '시도', '청년들',

        '인근', '워싱턴', '현대차', '외부', '점검', '동의', '절반',

        '카드', '혜택', '전문가들', '중앙', '소송', '위협', '열린',

        '국장', '주제', '사상', '존재', '무대', '가입',

        '밝혔습니다', '바탕', '근거', '형태', '비중', '도쿄', '시진핑',

        '양국', '국내', '교체', '권한', '목적', '실적',

        '자녀', '디자인', '개국', '주민들', '직원들',

        '현지시간', '시점', '연장', '취소', '어려움', '진단',

        '조건', '위치', '함께', '조작', '혁명',

        '수익', '재산', '수입', '유튜브', '취재', '홍보', '모바일', '당내', '리그',

        '지도자', '마무리', '극복', '해소', '현상', '기억', '원전', '신설',

        '따르면', '했다', '당장', '년대', '미군', '베이징', '호남', '한국인', '긴급', '기여', '모집', '영업', '정리',

        '답변', '수능', '선수들', '남자', '인도', '전면', '활성화', '부여', '부인',

        '평창', '충남', '작성', '의무', '인증', '얼마', '징역', '비난', '여자', '압박', '분기', '오후', '유명', '나이', '거론', '참가',

        '황교안', '달성', '초기', '자연', '가정', '비서관', '강남', '우승', '장기', '광고',

        '스마트', '베트남', '투자자', '사전', '토론', '세기', '재난', '군사', '보건', '소비',

        '지구', '집행', '포기', '의심', '등록', '평양', '사업자', '학년도', '시험', '수업', '전형', '면접', '졸업', '입학',
        '건강', '치료제', '매장', '고객', '임상', '수술', '음식', '넷플릭스', '선대위', '이낙연', '당선인',
        '인사', '캠프', '황보선', '단일화', '우크라이나', '안보', '바이든', '상장', '펀드', '국방부', '증시', '확진자', '접종', '마스크', '코로나바이러스', '확진', '감염증', '신종',
        '소상공인', '손흥민', '프로', '학대', '골프', '출전', '금메달', '폭행', '범행', '그룹', '고객', '탄소', 
        '처벌', '불법', '형사', '처분', '운동', '시위', '아프간', '탈레반', '시민들', '롯데', '계열사', '이재용', '펀드', '임원', '이사회', 
        '소설', '저자', '브라질', '월드컵', '문학', '자본주의', '전형', '공부', '영어', '수학', '졸업', '입학', '수업', '청구', '법률', '뇌물', '영장',
        '건설', '관광객', '제주도', '지진', '임대', '마리', '바다', '입주', '음식', '연기', '세대', '가수', '노래', '촬영', '관객', '축제', '얼굴', 
        '개헌', '안보', '국민의당', '공화당', '국방부', '민심', '업체', '창업', '건강', '의료', '해외', '수술',
        '오세훈', '푸틴', '이스라엘', '이란', '호주', '본부장','검수완박',
        '엄마', '남편', '인생', '예술', '그림', '순간', '도발', '힐러리', '국제사회', '구글', '애플', '화장품', '피부', '스타', '투수', '바둑', '경기장', '팬들',
        '어머니', '아버지', '가족', '삶', '행복', '기억', '마음', '이야기',
        '선수', '감독', '시합', '우승', '경기', '연습', '응원',
        '브랜드', '제품', '마케팅', '소비자', '구매', '대통령은', '대통령이', '정부가', '성적', '선발', '태도',
        '채널', '추가', '활성', '기자들', '만에', '집회', '국무총리', '기자가', '방침', '지속적', '기자입니다', '오전', '전시', '등을', '기자회견',
        '같은', '유치', '사무실', '전력', '의원들', '이미지', '주가', '이슈', '그간', '사회적', '인수', '추정', '소리','바람', '실패', '겅시', '집권',
        '축소', '모임', '자금', '이행', '별도', '충북', '대법원', '강원도', '연설', '약속',
        '집단', '여의도', '토론회', '세계적', '공감', '전북', '촉구', '대사', '우수', '배경', '에서',
        '훈련', '순위', '대표적', '설립', '연간', '노동당', '점수', '국무', '재개', '매체', '단독', '전용',
        '양성', '긍정적', '입법', '최선', '접수', '지수', '방지', '유통', '접근', '주석', '실현',
        '중심', '본회의', '불편', '여행', '본격적', '창출', '도움', '비용', '현안', '나머지', '강원',
        '불안', '자격', '명이', '외국', '승인', '심의', '말했다', '보상', '조기', '사항', '총괄',
        '행보', '확장', '정의', '파견', '하는', '비서실장', '장면', '유일', '임직원', '선출', '의회',
        '전년', '브리핑', '당부', '배제', '연대', '전통', '박사', '회동', '경고', '환경부', '소장',
        '싱가포르', '기구','예측', '적발', '최소', '생명', '대안', '실험', '지역구', '간부'
        
    ]
